[Rainmeter]
;导入Skins
@Include1 = #RootConfigPath#\StatusBar\StatusBar.ini
@Include2 = #RootConfigPath#\Terminal\#MainPanelTerminalType#Terminal.ini
@Include3 = #RootConfigPath#\Button\Button_x2.ini
@Include4 = #RootConfigPath#\Links\Links.ini
@Include5 = #RootConfigPath#\ButtonDeco\ButtonDeco.ini
@Include6 = #RootConfigPath#\Storage\Storage.ini
;别 改 刷 新 间 隔 ！
update = 1000
accurateText = 0
dynamicWindowSize = 0
skinWidth = (#MainPanelOffsetX#+800)
group = ToggleByAssistBtn

[Metadata]
name = Rhodes_Island_UI
author = 热心炎国云玩家
information = 让您在PC上也能享受到罗德岛终端系统的交互界面。|此为右面板组件组合。
license = Closure Commons 署名-不许获利-传递下去 42.0
version = 0.8.3

[Variables]
;导入独立自定义配置
@Include9 = #@#CustomMainPanel.ini

;强制关闭可视化，在本缝合中启用可视化降低刷新间隔是不理智的。
ShowVis = 0
;设置位置
RowSysX = (#MainPanelOffsetX#-0)
RowSysY = 0
RowStatusX = (#MainPanelOffsetX#-60)
RowStatusY = 40
RowTerminalX = (#MainPanelOffsetX#-0)
RowTerminalY = 120
RowButtonX = (#MainPanelOffsetX#-40)
RowButtonY = 380
RowLinksX = (#MainPanelOffsetX#+65)
RowLinksY = 550
Row4Col1X = (#MainPanelOffsetX#-0)
Row4Col1Y = (720-4)
Row4Col2X = (#MainPanelOffsetX#-0+20+310)
Row4Col2Y = (720-8)


[RowBtnPlaceHolder]
meter = Image
solidColor = 0,0,0,150
x = (#RowButtonX#+((370+20)*2))
y = #RowButtonY#
w = 150
h = 150